package com.example.totanpay.data.repository.datasource.transaction

enum class ResponseMessageContainer (val code:String,val message:String){
    RC_6("-6","خطا در ارسال تراکنش"),
    RC_5("-5","خطا در برقراری ارتباط"),

    RC_1("-1","خطا در دریافت اطلاعات"),
    RC_2("-2", "خطا در ارسال تراکنش تسویه-بازگشت"),

    RC_01("01","به صادر کننده کارت رجوع شود، تراکنش لغو شد"),
    RC_02("02","با توجه به شرایط خاص بوجود آمده به صادر کننده کارت رجوع شود."),
    RC_03("03","پذیرنده فروشگاهی  معتبر نیست."),
    RC_04("04","کارت نامعتبر است"),


    RC_05("05","مجوز صادر نشود"),
    RC_06("06","خطا"),
    RC_07("07","کارت نامعتبر است"),
    RC_08("08","مجوز پس از شناسایی صادر شود، تراکنش انجام شد"),

    RC_09("09","صادر کننده کارت نامعتبر است"),
    RC_10("10","تراکنش با جزئی از مبلغ انجام شد، تراکنش انجام شد"),
    RC_11("11","تراکنش جهت اشخاص خاص انجام شد"),
    RC12("12","تراکنش معتبر نیست"),
    RC13("13","مبلغ معتبر نیست"),
    RC14("14","شماره کارت معتبر نیست"),
    RC15("15","صادر کننده کارت نامعتبر است"),
    RC16("16","تراکنش پس از بروزرسانی کارت انجام شد، تراکنش انجام شد"),

    RC17("17","انصراف مشتری"),
    RC18("18","اعتراض مشتری"),
    RC19("19","تراکنش تکراری،تراکنش لغو شد"),
    RC20("20","پاسخ معتبر نیست"),
    RC21("21","عملیات خاصی انجام نشد"),
    RC22("22","احتمال خرابی"),
    RC23("23","کارمزد تراکنش غیرقابل اعمال است، تراکنش لغو شد"),
    RC24("24","دریافت کننده امکان پشتیبانی از عملیات فایلی را ندارد"),
    RC25("25","تراکنش اصلی یافت نشد"),
    RC26("26","عملیات فایلی مربوط به رکورد تکراری است. رکورد قبلی جایگزین می شود"),
    RC27("27","عملیات فایلی تصحیح فیلد با خطا مواجه شد"),
    RC28("28","انجام عملیات فایلی روی یک فایل قفل شده است"),
    RC29("29","عملیات فایلی موفقیت آمیز نبود، با پذیرنده تماس بگیرید"),
    RC30("30","اشکال در فرمت اطلاعات"),
    RC31("31","بانک توسط سوییچ پشتیبانی نمی شود، تراکنش لغو شد"),
    RC32("32","تراکنش به صورت جزئی انجام شد"),
    RC33("33", "کارت منقضی شده"),
    RC34("34",""),//"احتمال سواستفاده، ضبط کارت"
    RC35("35","دریافت کننده کارت نمی تواند یک پذیرنده باشد،ضبط کارت"),
    RC36("36","کارت نامعتبر"),
    RC37("37","کارت نامعتبر"),
    R38("38","تعداد دفعات مجاز تکرار رمز مشتری به پایان رسید"),
    RC39("39","حساب اعتباری وجود ندارد،تراکنش لغو شد"),
    RC40("40","عملیات درخواستی پشتیبانی نمی شود،تراکنش لغو شد"),
    RC41("41","کارت نامعتبر"),
    RC42("42","حساب عمومی وجود ندارد،تراکنش لغو شد"),
    RC43("43",""),//"کارت مسروقه-ضبط کارت"
    RC44("44","حساب سرمایه گذاری وجود ندارد،تراکنش لغو شد"),
    RC51("51","موجوی حساب کافی نیست،تراکنش لغو شد"),
    RC52("52","حساب جاری وجود ندارد،تراکنش لغو شد"),
    RC53("53","حساب پس انداز موجود نیست،تراکنش لغو شد"),
    RC54("54","کارت منقضی شده است، تراکنش لغو شد"),
    RC55("55","رمز اشتباه است،تراکنش لغو شد"),
    RC56("56", "کارت نامعتبر"),
    RC57("57","دارنده کارت مجاز به انجام تراکنش نیست،تراکنش لغو شد"),
    RC58("58","پایانه مجاز به انجام تراکنش نیست،تراکنش لغو شد"),
    RC59("59","احتمال سو استفاده،تراکنش لغو شد"),
    RC60("60","دریافت کننده کارت نمیتواند یک  پذیرنده باشد، تراکنش لغو شد"),
    RC61("61","مبلغ نامعتبر"),
    RC62("62","کارت نامعتبر"),
    RC63("63","نقض موارد امنیتی"),//
    RC64("64","مبلغ تراکنش اصلی اشتباه است،تراکنش لغو شد"),
    RC65("65","مبلغ از سقف دوره ای برداشت نقدی بیشتر است،تراکنش لغو شد"),
    RC66("66","تماس دریافت کننده کارت با تشکیلات امنیتی پذیرنده، تراکنش لغو شد"),
    RC67("67","ضبط کارت"),
    RC68("68","پاسخ در فرصت مشخص شده دریافت نشد"),
    RC75("75","تعداد دفعات مجاز تکرار رمز مشتری به پایان رسید،تراکنش لغو شد"),
    RC77("77","تاریخ تراکنش معتبر نیست"),
    RC90("90","عملیات تعویض دوره مالی در حال انجام است"),
    RC91("91","صادر کننده یا سوئیچ در حال انجام عملیات هستند-تراکنش لغو شد"),
    RC92("92","موسسه مالی یا شبکه ارتباط جهت مسیریابی در دسترس نیست،تراکنش لغو شد"),
    RC93("93","امکان تکمیل تراکنش وجود ندارد"),


    RC94("94","تراکنش تکراری است"),
    RC95("95","تسویه حساب با خطا مواجه شد"),

    RC96("96","اشکال در عملکرد سیستم")
    ,    RCUNKNOWN("","خطا")

    ;
    companion object {
        fun valueOfLabel(code: String): ResponseMessageContainer {
            var temp: ResponseMessageContainer? = null
            for (e in ResponseMessageContainer.values()) {
                if (e.code == code) {
                    temp = e
                }
            }
            return temp?:RCUNKNOWN
        }
    }
}